<h1 style="color: red">Третье задание</h1>
<h2>      Первый пример - сложность O в квадрате      </h2>
<?php

// $n = 10000;
// $array[]= [];

// for ($i = 0; $i < $n; $i++) {
//   for ($j = 1; $j < $n; $j *= 2) {
//      $array[$i][$j]= true;
// 	}
// }

?>
<h2>      Второй пример - сложность O(n в квадрате)      </h2>
<?php

// $n = 10000;
// $array[] = [];

// for ($i = 0; $i < $n; $i += 2) {
//   for ($j = $i; $j < $n; $j++) {
//    $array[$i][$j]= true;
// 	}
// }

?>
<h2>      Третий пример - сложность O(n)      </h2>
<?php

// $n = 10000;
// $array[] = [];
// foo($n);

// function foo($n)
// {
//     while ($n > 0) {
//         for ($j =0; $j < $n; $j++) {
//             $n--;
//             foo($n);
//         }
//     }
// }

?>




